Радченко_на_EDT_Project/src/DataProcessors/РаботаСЗапросами/РаботаСЗапросами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСЗапросами</name>
</mdclass:DataProcessor>

Радченко_на_EDT_Project/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаборСвойств</name>
      <type>
        <types>CatalogRef.ВариантыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Радченко_на_EDT_Project/src/DataProcessors/РаботаСЗапросами/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	Приход.Материал КАК Материал,
	|	Приход.Ссылка.Дата,
	|	Приход.Ссылка.Номер
	|ПОМЕСТИТЬ ВТПриход
	|ИЗ
	|	Документ.ПриходнаяНакладная.Материалы КАК Приход
	|ГДЕ
	|	Приход.Ссылка.Номер = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Материал";
	
	Запрос.УстановитьПараметр("Ссылка", "000000001");
	Запрос.Выполнить();
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = "ВЫБРАТЬ
	|	Ном.Наименование,
	|	ВТПриход.Дата,
	|	ВТПриход.Номер
	|ИЗ
	|	ВТПриход КАК ВТПриход
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ВТПриход.Материал = Ном.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном.Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос2.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сообщить("" + Строка(Выборка.Наименование) + ", "  + Строка(Выборка.Дата) + ", " + Строка(Выборка.Номер));
		
	КонецЦикла;
	
КонецПроцедуры
